Bharaths25/STM32H753xx_BareMetalCode/test_board1/Src/stm32h753_usart_driver.c
/*
 * stm32h753_usart_driver.c
 *
 *  Created on: Aug 4, 2024
 *      Author: Bharath
 */


#include "stm32h753_usart_driver.h"
#include "stm32h753xx.h"

/*
 * Peripheral Clock setup
 */
/*****************************************************************
 * @fn          - USART_PeriClockControl
 *
 * @brief       - This function enables or disables peripheral
 *                clock for the given U(S)ART port
 *
 * @param[in]   - Base address of the U(S)ART peripheral
 * @param[in]   - Macros: Enable or Disable
 *
 * @return      - None
 *
 * @Note        - None
 *
 *****************************************************************/
void USART_PeriClockControl(USART_RegDef_t *pUSARTx, uint8_t EnorDi)
{
    if(EnorDi == Enable)
    {
        if(pUSARTx == USART1)
        {
            USART1_PCLK_EN();
        }
        else if(pUSARTx == USART2)
        {
            USART2_PCLK_EN();
        }
        else if(pUSARTx == USART3)
        {
            USART3_PCLK_EN();
        }
        else if(pUSARTx == UART4)
        {
            UART4_PCLK_EN();
        }
        else if(pUSARTx == UART5)
        {
            UART5_PCLK_EN();
        }
        else if(pUSARTx == USART6)
        {
            USART6_PCLK_EN();
        }else if(pUSARTx == UART7)
        {
            UART7_PCLK_EN();
        }
        else if(pUSARTx == UART8)
        {
            UART8_PCLK_EN();
        }
    }
    else
    {
        if(pUSARTx == USART1)
        {
            USART1_PCLK_DEN();
        }
        else if(pUSARTx == USART2)
        {
            USART2_PCLK_DEN();
        }
        else if(pUSARTx == USART3)
        {
            USART3_PCLK_DEN();
        }
        else if(pUSARTx == UART4)
        {
            UART4_PCLK_DEN();
        }
        else if(pUSARTx == UART5)
        {
            UART5_PCLK_DEN();
        }
        else if(pUSARTx == USART6)
        {
            USART6_PCLK_DEN();
        }else if(pUSARTx == UART7)
        {
            UART7_PCLK_DEN();
        }
        else if(pUSARTx == UART8)
        {
            UART8_PCLK_DEN();
        }
    }
}


/*****************************************************************
 * @fn          - USART_PeripheralControl
 *
 * @brief       - This function sets U(S)ART peripheral control
 *
 * @param[in]   - Base address of the U(S)ART peripheral
 * @param[in]   - Enable or Disable command
 *
 * @return      - None
 *
 * @Note        - None
 *
 *****************************************************************/
void USART_PeripheralControl(USART_RegDef_t *pUSARTx, uint8_t EnorDi)
{
    if(EnorDi == Enable)
    {
        pUSARTx->CR1 |= (1 << USART_CR1_UESM);
    }
    else
    {
        pUSARTx->CR1 &= ~(1 << USART_CR1_UESM);
    }
}


/*
 * Init and De-Init
 */
/*****************************************************************
 * @fn          - USART_Init
 *
 * @brief       - This function initialize USART peripherals
 *
 * @param[in]   - Pointer to USART Handle structure
 *
 * @return      - None
 *
 * @Note        - None
 *
 *****************************************************************/
void USART_Init(USART_Handle_t *pUSARTHandle)
{
    uint32_t tempreg = 0;

    /* CR1 Configuration */
    /* Enabling clock for U(S)ART peripheral */
    USART_PeriClockControl(pUSARTHandle->pUSARTx, Enable);

    /* Enabling USART Tx and Rx engines according to the USART Mode Config. item */
    if ( pUSARTHandle->USART_Config.USART_Mode == USART_MODE_ONLY_RX)
    {
        /* Enabling Receiver bit field */
        tempreg |= (1 << USART_CR1_RE);
    }
    else if (pUSARTHandle->USART_Config.USART_Mode == USART_MODE_ONLY_TX)
    {
        /* Enabling Transmitter bit field */
        tempreg |= (1 << USART_CR1_TE);
    }
    else if (pUSARTHandle->USART_Config.USART_Mode == USART_MODE_TXRX)
    {
        /* Enabling both, Transmitter and Receiver bit fields */
        tempreg |= (1 << USART_CR1_TE);
        tempreg |= (1 << USART_CR1_RE);
    }

    /* Configuring Word Length configuration item */
    tempreg |= pUSARTHandle->USART_Config.USART_WordLength << USART_CR1_M0;

    /* Parity control bit fields control */
    if ( pUSARTHandle->USART_Config.USART_ParityControl == USART_PARITY_EN_EVEN)
    {
        /* Enabling parity control. EVEN parity select by default */
        tempreg |= (1 << USART_CR1_PCE);

    }else if (pUSARTHandle->USART_Config.USART_ParityControl == USART_PARITY_EN_ODD )
    {
        /* Enabling parity control */
        tempreg |= (1 << USART_CR1_PCE);

        /* Enabling ODD parity */
        tempreg |= (1 << USART_CR1_PS);
    }

    /* Programming CR1 register */
    pUSARTHandle->pUSARTx->CR1 = tempreg;


    /* CR2 Configuration */
    tempreg=0;

    /* Configuring number of STOP bits inserted during USART frame transmission */
    tempreg |= pUSARTHandle->USART_Config.USART_NoOfStopBits << USART_CR2_STOP;

    /* Programming CR2 register */
    pUSARTHandle->pUSARTx->CR2 = tempreg;


    /* CR3 Configuration */
    tempreg=0;

    /* USART Hardware Flow control Configuration */
    if ( pUSARTHandle->USART_Config.USART_HWFlowControl == USART_HW_FLOW_CTRL_CTS)
    {
        /* Enabling CTS Flow control */
        tempreg |= (1 << USART_CR3_CTSE);
    }
    else if (pUSARTHandle->USART_Config.USART_HWFlowControl == USART_HW_FLOW_CTRL_RTS)
    {
        /* Enabling RTS flow control */
        tempreg |= (1 << USART_CR3_RTSE);

    }else if (pUSARTHandle->USART_Config.USART_HWFlowControl == USART_HW_FLOW_CTRL_CTS_RTS)
    {
        /* Enabling both CTS and RTS Flow control */
        tempreg |= (1 << USART_CR3_CTSE);
        tempreg |= (1 << USART_CR3_RTSE);
    }

    pUSARTHandle->pUSARTx->CR3 = tempreg;

    /* Configuring baud rate */
    USART_SetBaudRate(pUSARTHandle->pUSARTx, pUSARTHandle->USART_Config.USART_Baud);
}


/*****************************************************************
 * @fn          - USART_DeInit
 *
 * @brief       - This function de-initialize U(S)ART peripherals
 *
 * @param[in]   - Base address of the U(S)ART peripheral
 *
 * @return      - None
 *
 * @Note        - None
 *
 *****************************************************************/
void USART_DeInit(USART_RegDef_t *pUSARTx)
{
    if(pUSARTx == USART1)
    {
        USART1_REG_RESET();
    }
    else if(pUSARTx == USART2)
    {
        USART2_REG_RESET();
    }
    else if(pUSARTx == USART3)
    {
        USART3_REG_RESET();
    }
    else if(pUSARTx == UART4)
    {
        UART4_REG_RESET();
    }
    else if(pUSARTx == UART5)
    {
        UART5_REG_RESET();
    }
    else if(pUSARTx == USART6)
    {
        USART6_REG_RESET();
    }else if(pUSARTx == UART7)
    {
        UART7_REG_RESET();
    }
    else if(pUSARTx == UART8)
    {
        UART8_REG_RESET();
    }
}


/*****************************************************************
 * @fn          - USART_GetFlagStatus
 *
 * @brief       - This function returns if bit in register is
 *                set or not
 *
 * @param[in]   - Base address of the U(S)ART peripheral
 * @param[in]   - Name of flag
 *
 * @return      - Flag status (True/False)
 *
 * @Note        - None
 *
 *****************************************************************/
uint8_t USART_GetFlagStatus(USART_RegDef_t *pUSARTx , uint32_t FlagName)
{
    if(pUSARTx->ISR & FlagName)
    {
        return FLAG_SET;
    }
    return FLAG_RESET;
}


/*****************************************************************
 * @fn          - USART_ClearFlag
 *
 * @brief       - This function clears status flag
 *
 * @param[in]   - Base address of the U(S)ART peripheral
 * @param[in]   - Name of flag
 *
 * @return      - None
 *
 * @Note        - None
 *
 *****************************************************************/
void USART_ClearFlag(USART_RegDef_t *pUSARTx, uint16_t FlagName)
{
    pUSARTx->ISR &= ~(1 << FlagName);
}



/******************************************************************
 * @fn          - USART_SendData
 *
 * @brief       - This function sends data over U(S)ART
 *
 * @param[in]   - Pointer to U(S)ART Handle Structure
 * @param[in]   - Pointer to Tx Buffer
 * @param[in]   - Length of Tx Buffer
 *
 * @return      - None
 *
 * @Note        - None
 *
 *****************************************************************/
void USART_SendData(USART_Handle_t *pUSARTHandle, uint8_t *pTxBuffer, uint32_t Length)
{
    uint16_t *pdata;

    /* Looping over until "Length" of bytes are transferred */
    for(uint32_t i = 0 ; i < Length; i++)
    {
        /* Waiting till TXE flag is set in SR */
        while(! USART_GetFlagStatus(pUSARTHandle->pUSARTx, USART_FLAG_TXE));

        /* Checking USART_WordLength item for 9BIT or 8BIT in a frame */
        if(pUSARTHandle->USART_Config.USART_WordLength == USART_WORDLEN_9BITS)
        {
            /* If 9BIT, load DR with 2 bytes masking the bits other than first 9 bits */
            pdata = (uint16_t*) pTxBuffer;
            pUSARTHandle->pUSARTx->RDR = (*pdata & (uint16_t)0x01FF);

