Bharaths25/STM32H753xx_BareMetalCode/test_board1/Src/stm32h753_usart_driver.c
            /* Checking for USART ParityControl */
            if(pUSARTHandle->USART_Config.USART_ParityControl == USART_PARITY_DISABLE)
            {
                /* No parity is used in this transfer. 9bits of user data will be sent */
                pTxBuffer++;
                pTxBuffer++;
            }
            else
            {
                /* Parity bit is used in this transfer. 8bits of user data will be sent */
                pTxBuffer++;
            }
        }
        else
        {
            /* 8bit data transfer */
            pUSARTHandle->pUSARTx->RDR = (*pTxBuffer  & (uint8_t)0xFF);

            /* Increment buffer address */
            pTxBuffer++;
        }
    }

    /* Waiting till TC flag is set in SR */
    while( ! USART_GetFlagStatus(pUSARTHandle->pUSARTx,USART_FLAG_TC));
}



/******************************************************************
 * @fn          - USART_ReceiveData
 *
 * @brief       - This function receives data over U(S)ART
 *
 * @param[in]   - Pointer to U(S)ART Handle Structure
 * @param[in]   - Pointer to Rx Buffer
 * @param[in]   - Length of Rx Buffer
 *
 * @return      - None
 *
 * @Note        - None
 *
 *****************************************************************/
void USART_ReceiveData(USART_Handle_t *pUSARTHandle, uint8_t *pRxBuffer, uint32_t Length)
{
    /* Looping over until "Length" of bytes are transferred */
    for(uint32_t i = 0 ; i < Length; i++)
    {
        /* Waiting till TXE flag is set in SR */
        while(! USART_GetFlagStatus(pUSARTHandle->pUSARTx, USART_FLAG_RXNE));

        /* Checking USART_WordLength item for 9BIT or 8BIT in a frame */
        if(pUSARTHandle->USART_Config.USART_WordLength == USART_WORDLEN_9BITS)
        {
            /* Receiving 9bit data in frame */

            /* Checking if USART_ParityControl control is used or not */
            if(pUSARTHandle->USART_Config.USART_ParityControl == USART_PARITY_DISABLE)
            {
                /* No parity is used. 9bits will be of user data */

                /* Reading only first 9 bits. Masking DR with 0x01FF */
                *((uint16_t*) pRxBuffer) = (pUSARTHandle->pUSARTx->RDR  & (uint16_t)0x01FF);

                /* Incrementing pRxBuffer address */
                pRxBuffer++;
                pRxBuffer++;
            }
            else
            {
                /* Parity is used. 8bits will be user data and 1 bit is parity */
                /* Reading only 7 bits. Masking DR with 0xFF */
                *pRxBuffer = (pUSARTHandle->pUSARTx->RDR  & (uint8_t)0xFF);

                /* Incrementing pRxBuffer address */
                pRxBuffer++;
            }
        }
        else
        {
            /* Receiving 8bit data in a frame */
            /* Checking if USART_ParityControl is used or not */
            if(pUSARTHandle->USART_Config.USART_ParityControl == USART_PARITY_DISABLE)
            {
                /* No parity is used. 9bits will be of user data */
                /* Reading 8 bits from DR */
                *pRxBuffer = (uint8_t)(pUSARTHandle->pUSARTx->RDR & (uint8_t)0xFF);
            }

            else
            {
                /* Parity is used. 7bits will be user data and 1 bit is parity */
                /* Reading only 7 bits. Masking DR with 0x7F */
                *pRxBuffer = (uint8_t)(pUSARTHandle->pUSARTx->RDR & (uint8_t)0x7F);
            }

            /* Incrementing Rx Buffer */
            pRxBuffer++;
        }
    }
}



/******************************************************************
 * @fn          - USART_SendDataInterrupt
 *
 * @brief       - This function sends data over U(S)ART
 *                in interrupt mode
 *
 * @param[in]   - Pointer to U(S)ART Handle Structure
 * @param[in]   - Pointer to Tx Buffer
 * @param[in]   - Length of Tx Buffer
 *
 * @return      - Tx state
 *
 * @Note        - None
 *
 *****************************************************************/
uint8_t USART_SendDataInterrupt(USART_Handle_t *pUSARTHandle,uint8_t *pTxBuffer, uint32_t Length)
{
    uint8_t txstate = pUSARTHandle->TxBusyState;

    if(txstate != USART_BUSY_IN_TX)
    {
        pUSARTHandle->TxLen = Length;
        pUSARTHandle->pTxBuffer = pTxBuffer;
        pUSARTHandle->TxBusyState = USART_BUSY_IN_TX;

        /* Enabling interrupt for TXE */
        pUSARTHandle->pUSARTx->CR1 |= (1 << USART_CR1_TXFNFIE);

        /* Enabling interrupt for TC */
        pUSARTHandle->pUSARTx->CR1 |= (1 << USART_CR1_TCIE);
    }

    return txstate;

}


/******************************************************************
 * @fn          - USART_ReceiveDataInterrupt
 *
 * @brief       - This function receives data over U(S)ART
 *                in interrupt mode
 *
 * @param[in]   - Pointer to U(S)ART Handle Structure
 * @param[in]   - Pointer to Rx Buffer
 * @param[in]   - Length of Rx Buffer
 *
 * @return      - Rx state
 *
 * @Note        - None
 *
 *****************************************************************/
uint8_t USART_ReceiveDataInterrupt(USART_Handle_t *pUSARTHandle, uint8_t *pRxBuffer, uint32_t Length)
{
    uint8_t rxstate = pUSARTHandle->RxBusyState;

    if(rxstate != USART_BUSY_IN_RX)
    {
        pUSARTHandle->RxLen = Length;
        pUSARTHandle->pRxBuffer = pRxBuffer;
        pUSARTHandle->RxBusyState = USART_BUSY_IN_RX;

        /* Enabling RXNE interrupt */
        pUSARTHandle->pUSARTx->CR1 |= (1 << USART_CR1_RXFNEIE);
    }

    return rxstate;
}


/*
 * IRQ Configuration and ISR handling
 */
/*****************************************************************
 * @fn          - USART_IRQConfig
 *
 * @brief       - This function configures interrupt
 *
 * @param[in]   - IRQ Interrupt number
 * @param[in]   - Macro: Enable/Disable
 *
 * @return      - None
 *
 * @Note        - None
 *
 *****************************************************************/

