Bharaths25/STM32H753xx_BareMetalCode/test_board1/Src/stm32h753_usart_driver.c
void USART_IRQInterruptConfig(uint8_t IRQNumber ,uint8_t EnorDi)
{
	if(EnorDi == Enable)
	{
	  if(IRQNumber <= 31)
	  {
		  //program ISER0 register
		  *NVIC_ISER0 |= (1 << IRQNumber);

	  }else if(IRQNumber > 31 && IRQNumber <64) //32 to 63
	  {
		  //program ISER1 register
		  *NVIC_ISER1 |= (1 << IRQNumber % 32);

	  }else if(IRQNumber >= 64 && IRQNumber < 96) //64 to 95
	  {
		  //program ISER2 register
		  *NVIC_ISER3 |= (1 << IRQNumber % 64);

	  }else
	  {
		  if(IRQNumber <- 31)
		  {
			  //program ICER0 register
			  *NVIC_ICER0 |= (1 << IRQNumber);

		  }else if(IRQNumber > 31 && IRQNumber <64) //32 to 63
		  {
			  //program ICER1 register
			  *NVIC_ICER1 |= (1 << IRQNumber % 32);

		  }else if(IRQNumber >=64 && IRQNumber <96) //64 to 95
		  {
			  //program ICER2 register
			  *NVIC_ICER3 |= (1 << IRQNumber % 64);

		  }
	  }
	}
}

/*****************************************************************
 * @fn          - USART_IRQPriorityConfig
 *
 * @brief       - This function configures interrupt priority
 *
 * @param[in]   - Handle structure
 *
 * @return      - None
 *
 * @Note        - None
 *
 *****************************************************************/
void USART_IRQPriorityConfig(uint8_t IRQNumber ,uint32_t IRQPriority)
{
		//1. find out the ipr register
	uint8_t iprx = IRQNumber / 4;
	uint8_t iprx_section = IRQNumber % 4;

	uint8_t shift_amount = (8 * iprx_section) + (8 - NO_PR_BITS_IMPLEMENTED);
	*(NVIC_PR1_BADDR + iprx*4) |= IRQPriority << (shift_amount);
	// *(NVIC_PR_BADDR + iprx*4) |= IRQPriority << (8 * iprx_section);
	//go through this
}



/*****************************************************************
 * @fn          - USART_IRQHandling
 *
 * @brief       - Interrupt handling for diff. U(S)ART events
 *
 * @param[in]   - Pointer to U(S)ART Handle structure
 *
 * @return      - None
 *
 * @Note        - None
 *
 *****************************************************************/
void USART_IRQHandling(USART_Handle_t *pUSARTHandle)
{
    uint32_t temp1 , temp2, temp3;

    uint16_t *pdata;

    /* Checking for TC Flag */
    /* Checking state of TC bit in the SR */
    temp1 = pUSARTHandle->pUSARTx->ISR & (1 << USART_ISR_TC);

    /* Checking state of TCEIE bit */
    temp2 = pUSARTHandle->pUSARTx->CR1 & (1 << USART_CR1_TCIE);

    if(temp1 && temp2)
    {
        /* TC caused Interrupt */

        /* Closing transmission and calling application callback if TxLen is zero */
        if (pUSARTHandle->TxBusyState == USART_BUSY_IN_TX)
        {
            /* Checking TxLen. If it's zero, close data transmission */
            if(!pUSARTHandle->TxLen)
            {
                /* Clearing TC flag */
                pUSARTHandle->pUSARTx->ISR &= ~(1 << USART_ISR_TC);

                /* Clearing TCIE bit */
                //pUSARTHandle->pUSARTx->CR1 &= ~(1 << USART_CR1_TCIE);

                /* Resetting application state */
                pUSARTHandle->TxBusyState = USART_READY;

                /* Resetting buffer address to NULL */
                pUSARTHandle->pTxBuffer = NULL;

                /* Resetting length to zero */
                pUSARTHandle->TxLen = 0;

                /* Calling application callback with event USART_EVENT_TX_CMPLT */
                USART_ApplicationEventCallback(pUSARTHandle,USART_EVENT_TX_CMPLT);
            }
        }
    }

    /* Checking for TXE flag */
    /* Checking state for TXE bit in the SR */
    temp1 = pUSARTHandle->pUSARTx->ISR & (1 << USART_ISR_TXFNE);

    /* Checking state for TXEIE bit in the CR1 */
    temp2 = pUSARTHandle->pUSARTx->CR1 & (1 << USART_CR1_TXFNFIE);

    if(temp1 && temp2)
    {
        /* TXE caused interrupt */

        if(pUSARTHandle->TxBusyState == USART_BUSY_IN_TX)
        {
            /* Keep sending data till TxLen reaches zero */
            if(pUSARTHandle->TxLen > 0)
            {
                /* Checking the USART_WordLength item for 9BIT or 8BIT in a frame */
                if(pUSARTHandle->USART_Config.USART_WordLength == USART_WORDLEN_9BITS)
                {
                    /* If 9BIT load the DR with 2 bytes masking the bits other than first 9 bits */
                    pdata = (uint16_t*)pUSARTHandle->pTxBuffer;
                    pUSARTHandle->pUSARTx->RDR = (*pdata & (uint16_t)0x01FF);

                    /* Checking for USART_ParityControl */
                    if(pUSARTHandle->USART_Config.USART_ParityControl == USART_PARITY_DISABLE)
                    {
                        /* No parity used in this transfer. 9 bits of user data will be sent */
                        pUSARTHandle->pTxBuffer++;
                        pUSARTHandle->pTxBuffer++;
                        pUSARTHandle->TxLen-=2;
                    }
                    else
                    {
                        /* Parity used in this transfer. 8 bits of user data will be sent.
						   9th bit will be replaced by parity bit by the hardware        */
                        pUSARTHandle->pTxBuffer++;
                        pUSARTHandle->TxLen-=1;
                    }
                }
                else
                {
                    /* 8bit data transfer */
                    pUSARTHandle->pUSARTx->RDR = (*pUSARTHandle->pTxBuffer & (uint8_t)0xFF);

                    /* Incrementing buffer address */
                    pUSARTHandle->pTxBuffer++;
                    pUSARTHandle->TxLen-=1;
                }
            }
            if (pUSARTHandle->TxLen == 0 )
            {
                /* Tx Len is zero. Clearing TXEIE bit (disabling interrupt for TXE flag) */
                pUSARTHandle->pUSARTx->CR1 &= ~( 1 << USART_CR1_TXFNFIE);
            }
        }
    }

    /* Checking for RXNE flag */
    temp1 = pUSARTHandle->pUSARTx->ISR & ( 1 << USART_ISR_RXFNE);
    temp2 = pUSARTHandle->pUSARTx->CR1 & ( 1 << USART_CR1_RXFNEIE);

    if(temp1 && temp2)
    {
        /* RXNE caused interrupt */
        if(pUSARTHandle->RxBusyState == USART_BUSY_IN_RX)
        {
            if(pUSARTHandle->RxLen > 0)
            {
                /* Checking the USART_WordLength item for 9BIT or 8BIT in a frame */
                if(pUSARTHandle->USART_Config.USART_WordLength == USART_WORDLEN_9BITS)
                {
                    /* Receiving 9bit data in a frame */

                    /* Checking if USART_ParityControl control is used or not */
                    if(pUSARTHandle->USART_Config.USART_ParityControl == USART_PARITY_DISABLE)
                    {
                        /* No parity is used. All 9bits will be of user data */

                        /* Reading only first 9 bits. Masking DR with 0x01FF */
                        *((uint16_t*) pUSARTHandle->pRxBuffer) = (pUSARTHandle->pUSARTx->RDR  & (uint16_t)0x01FF);

                        pUSARTHandle->pRxBuffer++;
                        pUSARTHandle->pRxBuffer++;
                        pUSARTHandle->RxLen-=2;
                    }
                    else
                    {
                        /* Parity is used. 8bits will be of user data and 1 bit is parity */
                        *pUSARTHandle->pRxBuffer = (pUSARTHandle->pUSARTx->RDR  & (uint8_t)0xFF);
                        pUSARTHandle->pRxBuffer++;
                        pUSARTHandle->RxLen-=1;
                    }
                }
                else
                {
                    /* Receiving 8bit data in a frame */

                    /* Checking if USART_ParityControl control is used or not */
                    if(pUSARTHandle->USART_Config.USART_ParityControl == USART_PARITY_DISABLE)
                    {
                        /* No parity is used. All 9bits will be of user data */

                        /* Reading 8 bits from DR */
                        *pUSARTHandle->pRxBuffer = (uint8_t)(pUSARTHandle->pUSARTx->RDR  & (uint8_t)0xFF);
                    }
                    else
                    {
                        /* Parity is used. 7 bits will be of user data and 1 bit is parity */

                        /* Reading only 7 bits. Masking DR with 0x7F */
                        *pUSARTHandle->pRxBuffer = (uint8_t) (pUSARTHandle->pUSARTx->RDR  & (uint8_t)0x7F);
                    }

                    /* Incrementing the pRxBuffer */
                    pUSARTHandle->pRxBuffer++;
                    pUSARTHandle->RxLen-=1;
                }
            }

            if(!pUSARTHandle->RxLen)
            {
                /* Disabling the RXNE */
                pUSARTHandle->pUSARTx->CR1 &= ~(1 << USART_CR1_RXFNEIE );
                pUSARTHandle->RxBusyState = USART_READY;
                USART_ApplicationEventCallback(pUSARTHandle,USART_EVENT_RX_CMPLT);
            }
        }
    }

    /* Checking for CTS flag. CTS feature is not applicable for UART4 and UART5 */
    /* Checking status of CTS bit in the SR */
    temp1 = pUSARTHandle->pUSARTx->ISR & (1 << USART_ISR_CTS);

    /* Checking state of CTSE bit in CR3 */
    temp2 = pUSARTHandle->pUSARTx->CR3 & (1 << USART_CR3_CTSE);

    /* Checking state of CTSIE bit in CR3 (This bit is not available for UART4 & UART5.) */
    temp3 = pUSARTHandle->pUSARTx->CR3 & (1 << USART_CR3_CTSIE);

