Bharaths25/STM32H753xx_BareMetalCode/test_board1/Src/stm32h753_usart_driver.c
    if(temp1 && temp2 && temp3)
    {
        /* Clearing CTS flag in SR */
        pUSARTHandle->pUSARTx->ISR &= ~(1 << USART_ISR_CTS);

        /* CTS caused interrupt */
        USART_ApplicationEventCallback(pUSARTHandle,USART_EVENT_CTS);
    }

    /* Checking for IDLE detection flag */
    /* Checking status of IDLE flag bit in SR */
    temp1 = pUSARTHandle->pUSARTx->ISR & (1 << USART_ISR_IDLE);

    /* Checking state of IDLEIE bit in CR1 */
    temp2 = pUSARTHandle->pUSARTx->CR1 & (1 << USART_CR1_IDLEIE);

    if(temp1 && temp2)
    {
        /* Clearing IDLE flag. Referring to the RM to understand the clear sequence */
        temp1 = pUSARTHandle->pUSARTx->ISR &= ~(1 << USART_ISR_IDLE);

        /* IDLE caused interrupt */
        USART_ApplicationEventCallback(pUSARTHandle,USART_EVENT_IDLE);
    }

    /* Checking for OverRun detection flag */

    /* Checking status of ORE flag in the SR */
    temp1 = pUSARTHandle->pUSARTx->ISR & USART_ISR_ORE;

    /* Checking status of RXNEIE  bit in the CR1 */
    temp2 = pUSARTHandle->pUSARTx->CR1 & USART_CR1_RXFNEIE;
    if(temp1  && temp2)
    {
        /* OverRun error caused interrupt */
        USART_ApplicationEventCallback(pUSARTHandle,USART_ERR_ORE);
    }

    /* Checking for Error Flag */
    /* Noise Flag, OverRun Error and Framing Error  in MultiBuffer Communication */
    /* This part of code will be executed only if MultiBuffer mode is used 		 */
    temp2 =  pUSARTHandle->pUSARTx->CR3 & (1 << USART_CR3_EIE) ;

    if(temp2 )
    {
        temp1 = pUSARTHandle->pUSARTx->ISR;
        if(temp1 & (1 << USART_ISR_FE))
        {
            /*
				This bit is set by hardware when a de-synchronization, excessive noise or a break character
				is detected. It is cleared by a software sequence (an read to the USART_SR register
				followed by a read to the USART_DR register).
             */
            USART_ApplicationEventCallback(pUSARTHandle,USART_ERR_FE);
        }

        if(temp1 & (1 << USART_ISR_NE))
        {
            /*
				This bit is set by hardware when noise is detected on a received frame. It is cleared by a
				software sequence (an read to the USART_SR register followed by a read to the
				USART_DR register).
             */
            USART_ApplicationEventCallback(pUSARTHandle,USART_ERR_NE);
        }

        if(temp1 & ( 1 << USART_ISR_ORE) )
        {
            USART_ApplicationEventCallback(pUSARTHandle,USART_ERR_ORE);
        }
    }
}

/*******************************************************************
 * @fn          - USART_SetBaudRate
 *
 * @brief       - This function sets U(S)ART Baudrate
 *
 * @param[in]   - Base address of the U(S)ART peripheral
 * @param[in]   - Baud rate value
 *
 * @return      - None
 *
 * @Note        - None
 *
 ********************************************************************/
void USART_SetBaudRate(USART_RegDef_t *pUSARTx, uint32_t BaudRate)
{
    /* Holds APB clock */
    uint32_t PCLKx;

    uint32_t usartdiv;

    /* Hold Mantissa and Fraction values */
    uint32_t M_part,F_part;

    uint32_t tempreg = 0;

    /* Getting value of APB bus clock into the variable PCLKxn */
    if(pUSARTx == USART1 || pUSARTx == USART6)
    {
        /* USART1 and USART6 are hanging on APB2 bus */
       // PCLKx = RCC_GetPCLK2Value();
    }
    else
    {
        // PCLKx = RCC_GetPCLK1Value();
    }

    /* Checking for OVER8 configuration bit */
    if(pUSARTx->CR1 & (1 << USART_CR1_OVER8))
    {
        /* OVER8 = 1. Over sampling by 8 */
        usartdiv = ((25 * PCLKx) / (2 * BaudRate));
    }
    else
    {
        /* OVER8 = 0. Over sampling by 16 */
        usartdiv = ((25 * PCLKx) / (4 * BaudRate));
    }

    /* Calculating Mantissa part */
    M_part = usartdiv/100;

    /* Placing Mantissa part in appropriate bit position. USART_BRR */
    tempreg |= M_part << 4;

    /* Extracting fractional part */
    F_part = (usartdiv - (M_part * 100));

    /* Calculating final fractional part */
    if(pUSARTx->CR1 & (1 << USART_CR1_OVER8))
    {
        /* OVER8 = 1. Over sampling by 8 */
        F_part = (((F_part * 8) + 50) / 100) & ((uint8_t)0x07);
    }
    else
    {
        /* OVER8 = 0. Over sampling by 16 */
        F_part = ((( F_part * 16) + 50) / 100) & ((uint8_t)0x0F);
    }

    /* Placing fractional part in appropriate bit position. USART_BRR */
    tempreg |= F_part;

    /* Copying value of tempreg in to BRR register */
    pUSARTx->BRR = tempreg;
}


/*****************************************************************
 * @fn          - USART_ApplicationEventCallback
 *
 * @brief       - Application event callback function
 *
 * @param[in]   - Handle structure
 * @param[in]   - Application event
 *
 * @return      - None
 *
 * @Note        - None
 *
 *****************************************************************/
__weak void USART_ApplicationEventCallback(USART_Handle_t *pUSARTHandle, uint8_t AppEvent)
{
    /* This is a week implementation. The application may override this function. */
}

